---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateWall
source: html/3fee9a31-e2ac-1a4e-31fd-c2908934b4ab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateWall Property

Wall is slightly off axis and may cause inaccuracies.

## Syntax (C#)
```csharp
public static FailureDefinitionId InaccurateWall { get; }
```